keevin-xu/TLE-EVB-test-program/keil/RTE/Device/TLE9855QX/mon.h
/*
 ***********************************************************************************************************************
 *
 * Copyright (c) 2018-2023, Infineon Technologies AG
 * All rights reserved.
 *
 * Redistribution and use in source and binary forms, with or without modification,are permitted provided that the
 * following conditions are met:
 *
 *   Redistributions of source code must retain the above copyright notice, this list of conditions and the  following
 *   disclaimer.
 *
 *   Redistributions in binary form must reproduce the above copyright notice, this list of conditions and the
 *   following disclaimer in the documentation and/or other materials provided with the distribution.
 *
 *   Neither the name of the copyright holders nor the names of its contributors may be used to endorse or promote
 *   products derived from this software without specific prior written permission.
 *
 * THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS "AS IS" AND ANY EXPRESS OR IMPLIED WARRANTIES,
 * INCLUDING, BUT NOT LIMITED TO, THE IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE
 * DISCLAIMED. IN NO EVENT SHALL THE COPYRIGHT HOLDER OR CONTRIBUTORS BE LIABLE  FOR ANY DIRECT, INDIRECT, INCIDENTAL,
 * SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR
 * SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY,
 * WHETHER IN CONTRACT, STRICT LIABILITY,OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT  OF THE
 * USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
 *
 **********************************************************************************************************************/
/**
 * \file     mon.h
 *
 * \brief    High Voltage Monitor Input low level access library
 *
 * \version  V0.2.5
 * \date     28. Aug 2023
 *
 * \note This file violates [MISRA 2012 Rule 11.1, required], [MISRA 2012 Rule 11.4, advisory], [MISRA 2012 Rule 11.6, required], [MISRA 2012 Rule 2.5, advisory]
 */

/*******************************************************************************
**                             Author(s) Identity                             **
********************************************************************************
** Initials     Name                                                          **
** ---------------------------------------------------------------------------**
** TS           T&S                                                           **
** BG           Blandine Guillot                                              **
*******************************************************************************/

/*******************************************************************************
**                          Revision Control History                          **
********************************************************************************
** V0.2.0: 2018-02-13, TS:   Initial version of revision history              **
** V0.2.2: 2019-01-28, TS:   __STATIC_INLINE changed to INLINE                **
**                           Doxygen update                                   **
**                           Revision history moved from mon.c to mon.h       **
**                           EXINT MONx Pos and Mask macros added             **
** V0.2.3: 2020-03-02, BG:   Updated revision history format                  **
** V0.2.4: 2022-01-21, JO:   EP-934: Updated copyright and branding           **
** V0.2.5: 2023-08-28, JO:   EP-435: Removed ARMCC v6 compiler warnings       **
*******************************************************************************/
 
#ifndef MON_H
#define MON_H

/*******************************************************************************
**                                  Includes                                  **
*******************************************************************************/
#include "tle985x.h"
#include "types.h"
#include "sfr_access.h"

/*******************************************************************************
**                          Global Macro Definitions                          **
*******************************************************************************/
/**\brief MONx Status Flag mask, MON1 LOW STATUS*/
#define MON1_STATUS_LOW  (0U)
/**\brief MONx Status Flag mask, MON1 HIGH STATUS*/
#define MON1_STATUS_HIGH (1U)
/**\brief MONx Status Flag mask, MON2 LOW STATUS*/
#define MON2_STATUS_LOW  (0U)
/**\brief MONx Status Flag mask, MON2 HIGH STATUS*/
#define MON2_STATUS_HIGH (1U)
/**\brief MONx Status Flag mask, MON3 LOW STATUS*/
#define MON3_STATUS_LOW  (0U)
/**\brief MONx Status Flag mask, MON3 HIGH STATUS*/
#define MON3_STATUS_HIGH (1U)
/**\brief MONx Status Flag mask, MON4 LOW STATUS*/
#define MON4_STATUS_LOW  (0U)
/**\brief MONx Status Flag mask, MON4 HIGH STATUS*/
#define MON4_STATUS_HIGH (1U)

/**\brief External Interrupt MON1 Rising Edge Bit Position*/
#define SCU_EXICON1_MON1_RE_Pos (0UL)
/**\brief External Interrupt MON1 Rising Edge Bit Mask*/
#define SCU_EXICON1_MON1_RE_Msk (0x01UL)
/**\brief External Interrupt MON1 Falling Edge Bit Position*/
#define SCU_EXICON1_MON1_FE_Pos (1UL)
/**\brief External Interrupt MON1 Falling Edge Bit Mask*/
#define SCU_EXICON1_MON1_FE_Msk (0x02UL)
/**\brief External Interrupt MON2 Rising Edge Bit Position*/
#define SCU_EXICON1_MON2_RE_Pos (2UL)
/**\brief External Interrupt MON2 Rising Edge Bit Mask*/
#define SCU_EXICON1_MON2_RE_Msk (0x04UL)
/**\brief External Interrupt MON2 Falling Edge Bit Position*/
#define SCU_EXICON1_MON2_FE_Pos (3UL)
/**\brief External Interrupt MON2 Falling Edge Bit Mask*/
#define SCU_EXICON1_MON2_FE_Msk (0x08UL)
/**\brief External Interrupt MON3 Rising Edge Bit Position*/
#define SCU_EXICON1_MON3_RE_Pos (4UL)
/**\brief External Interrupt MON3 Rising Edge Bit Mask*/
#define SCU_EXICON1_MON3_RE_Msk (0x10UL)
/**\brief External Interrupt MON3 Falling Edge Bit Position*/
#define SCU_EXICON1_MON3_FE_Pos (5UL)
/**\brief External Interrupt MON3 Falling Edge Bit Mask*/
#define SCU_EXICON1_MON3_FE_Msk (0x20UL)
/**\brief External Interrupt MON4 Rising Edge Bit Position*/
#define SCU_EXICON1_MON4_RE_Pos (6UL)
/**\brief External Interrupt MON4 Rising Edge Bit Mask*/
#define SCU_EXICON1_MON4_RE_Msk (0x40UL)
/**\brief External Interrupt MON4 Falling Edge Bit Position*/
#define SCU_EXICON1_MON4_FE_Pos (7UL)
/**\brief External Interrupt MON4 Falling Edge Bit Mask*/
#define SCU_EXICON1_MON4_FE_Msk (0x80UL)

