keevin-xu/TLE-EVB-test-program/keil/RTE/Device/TLE9855QX/mon.h
/*******************************************************************************
**                        Global Function Declarations                        **
*******************************************************************************/
/** \brief Initializes the MONx module.
 *
 * \ingroup mon_api
 */
void MONx_Init(void);

/** \brief Reads out the MONx Status
 *
 * \param Monx MONx status flag
 *
 * \brief <b>Example</b><br>
 * \brief This example reads MON4 Status.
 * ~~~~~~~~~~~~~~~{.c}
 * void Example_Function(void)
 * {
 *     uint8 status;
 *
 *     MON4_En();
 *     status = MONx_Get_Status(4u);
 * }
 * ~~~~~~~~~~~~~~~
 * \ingroup mon_api
 */
uint8 MONx_Get_Status(uint8 Monx);

/** \brief Debounces the MONx input and reads the logical input value
 *
 * \param Monx MONx status flag
 * \param MonActiveState Expected active state of the MONx input
 *
 * \result Active State after debouncing MONx
 *
 * \brief <b>Example</b><br>
 * \brief This example Debounces the MON2 input to Low Level and reads the logical input value.
 * ~~~~~~~~~~~~~~~{.c}
 * void Example_Function(void)
 * {
 *     uint8 stat;
 *
 *     MON2_En();
 *     stat = MONx_Debounce(2u,0u);
 * }
 * ~~~~~~~~~~~~~~~
 * \ingroup mon_api
 */
uint8 MONx_Debounce(uint8 Monx,uint8 MonActiveState);

/*******************************************************************************
**                        Inline Function Declarations                        **
*******************************************************************************/
/** \brief Clears MON1 on rising edge interrupt flag.
 *
 * \brief <b>Example</b><br>
 * \brief This example treats the MON1 on rising edge interrupt.
 * ~~~~~~~~~~~~~~~{.c}
 * void Example_Function(void)
 * {
 *   MON1_Int_En();  
 *   MON1_Rising_Edge_Int_En();
 *   if ((uint8)SCU->IRCON1.bit.MON1R == (uint8)1)
 *   {
 *     MON1_RISING_CALLBACK();
 *     MON1_Rising_Edge_Int_Clr();
 *   }
 * }
 * ~~~~~~~~~~~~~~~
 * \ingroup mon_api
 */
INLINE void MON1_Rising_Edge_Int_Clr(void);

/** \brief Clears MON1 on falling edge interrupt flag.
 *
 * \brief <b>Example</b><br>
 * \brief This example treats the MON1 on falling edge interrupt.
 * ~~~~~~~~~~~~~~~{.c}
 * void Example_Function(void)
 * {
 *   MON1_Int_En();  
 *   MON1_Falling_Edge_Int_En();
 *   if ((uint8)SCU->IRCON1.bit.MON1F == (uint8)1)
 *   {
 *     MON1_FALLING_CALLBACK();
 *     MON1_Falling_Edge_Int_Clr();
 *   }
 * }
 * ~~~~~~~~~~~~~~~
 * \ingroup mon_api
 */
INLINE void MON1_Falling_Edge_Int_Clr(void);

/** \brief Clears MON2 on rising edge interrupt flag.
 *
 * \brief <b>Example</b><br>
 * \brief This example treats the MON2 on rising edge interrupt.
 * ~~~~~~~~~~~~~~~{.c}
 * void Example_Function(void)
 * {
 *   MON2_Int_En();  
 *   MON2_Rising_Edge_Int_En();
 *   if ((uint8)SCU->IRCON1.bit.MON2R == (uint8)1)
 *   {
 *     MON2_RISING_CALLBACK();
 *     MON2_Rising_Edge_Int_Clr();
 *   }
 * }
 * ~~~~~~~~~~~~~~~
 * \ingroup mon_api
 */
INLINE void MON2_Rising_Edge_Int_Clr(void);

/** \brief Clears MON2 on falling edge interrupt flag.
 *
 * \brief <b>Example</b><br>
 * \brief This example treats the MON2 on falling edge interrupt.
 * ~~~~~~~~~~~~~~~{.c}
 * void Example_Function(void)
 * {
 *   MON2_Int_En();  
 *   MON2_Falling_Edge_Int_En();
 *   if ((uint8)SCU->IRCON1.bit.MON2F == (uint8)1)
 *   {
 *     MON2_FALLING_CALLBACK();
 *     MON2_Falling_Edge_Int_Clr();
 *   }
 * }
 * ~~~~~~~~~~~~~~~
 * \ingroup mon_api
 */
INLINE void MON2_Falling_Edge_Int_Clr(void);

/** \brief Clears MON3 on rising edge interrupt flag.
 *
 * \brief <b>Example</b><br>
 * \brief This example treats the MON3 on rising edge interrupt.
 * ~~~~~~~~~~~~~~~{.c}
 * void Example_Function(void)
 * {
 *   MON3_Int_En();  
 *   MON3_Rising_Edge_Int_En();
 *   if ((uint8)SCU->IRCON1.bit.MON3R == (uint8)1)
 *   {
 *     MON3_RISING_CALLBACK();
 *     MON3_Rising_Edge_Int_Clr();
 *   }
 * }
 * ~~~~~~~~~~~~~~~
 * \ingroup mon_api
 */
INLINE void MON3_Rising_Edge_Int_Clr(void);

/** \brief Clears MON3 on falling edge interrupt flag.
 *
 * \brief <b>Example</b><br>
 * \brief This example treats the MON3 on falling edge interrupt.
 * ~~~~~~~~~~~~~~~{.c}
 * void Example_Function(void)
 * {
 *   MON3_Int_En();  
 *   MON3_Falling_Edge_Int_En();
 *   if ((uint8)SCU->IRCON1.bit.MON3F == (uint8)1)
 *   {
 *     MON3_FALLING_CALLBACK();
 *     MON3_Falling_Edge_Int_Clr();
 *   }
 * }
 * ~~~~~~~~~~~~~~~
 * \ingroup mon_api
 */
INLINE void MON3_Falling_Edge_Int_Clr(void);

/** \brief Clears MON4 on rising edge interrupt flag.
 *
 * \brief <b>Example</b><br>
 * \brief This example treats the MON4 on rising edge interrupt.
 * ~~~~~~~~~~~~~~~{.c}
 * void Example_Function(void)
 * {
 *   MON4_Int_En();  
 *   MON4_Rising_Edge_Int_En();
 *   if ((uint8)SCU->IRCON1.bit.MON4R == (uint8)1)
 *   {
 *     MON4_RISING_CALLBACK();
 *     MON4_Rising_Edge_Int_Clr();
 *   }
 * }
 * ~~~~~~~~~~~~~~~
 * \ingroup mon_api
 */
INLINE void MON4_Rising_Edge_Int_Clr(void);

/** \brief Clears MON4 on falling edge interrupt flag.
 *
 * \brief <b>Example</b><br>
 * \brief This example treats the MON4 on falling edge interrupt.
 * ~~~~~~~~~~~~~~~{.c}
 * void Example_Function(void)
 * {
 *   MON4_Int_En();  
 *   MON4_Falling_Edge_Int_En();
 *   if ((uint8)SCU->IRCON1.bit.MON4F == (uint8)1)
 *   {
 *     MON4_FALLING_CALLBACK();
 *     MON4_Falling_Edge_Int_Clr();
 *   }
 * }
 * ~~~~~~~~~~~~~~~
 * \ingroup mon_api
 */
INLINE void MON4_Falling_Edge_Int_Clr(void);

/** \brief Enables MON1 on rising edge interrupt.
 *
 * \brief <b>Example</b><br>
 * \brief This example treats the MON1 on rising edge interrupt.
 * ~~~~~~~~~~~~~~~{.c}
 * void Example_Function(void)
 * {
 *   MON1_Int_En();  
 *   MON1_Rising_Edge_Int_En();
 *   if ((uint8)SCU->IRCON1.bit.MON1R == (uint8)1)
 *   {
 *     MON1_RISING_CALLBACK();
 *     MON1_Rising_Edge_Int_Clr();
 *   }
 * }
 * ~~~~~~~~~~~~~~~
 * \ingroup mon_api
 */
INLINE void MON1_Rising_Edge_Int_En(void);

/** \brief Disables MON1 on rising edge interrupt.
 *
 * \brief <b>Example</b><br>
 * \brief This example treats the MON1 on rising edge interrupt.
 * ~~~~~~~~~~~~~~~{.c}
 * void Example_Function(void)
 * {
 *   MON1_Int_En();  
 *   MON1_Rising_Edge_Int_En();
 *   if ((uint8)SCU->IRCON1.bit.MON1R == (uint8)1)
 *   {
 *     MON1_RISING_CALLBACK();
 *     MON1_Rising_Edge_Int_Clr();
 *   }
 *   MON1_Rising_Edge_Int_Dis();
 * }
 * ~~~~~~~~~~~~~~~
 * \ingroup mon_api
 */
INLINE void MON1_Rising_Edge_Int_Dis(void);

/** \brief Enables MON1 on falling edge interrupt.
 *
 * \brief <b>Example</b><br>
 * \brief This example treats the MON1 on falling edge interrupt.
 * ~~~~~~~~~~~~~~~{.c}
 * void Example_Function(void)
 * {
 *   MON1_Int_En();  
 *   MON1_Falling_Edge_Int_En();
 *   if ((uint8)SCU->IRCON1.bit.MON1F == (uint8)1)
 *   {
 *     MON1_FALLING_CALLBACK();
 *     MON1_Falling_Edge_Int_Clr();
 *   }
 * }
 * ~~~~~~~~~~~~~~~
 * \ingroup mon_api
 */
INLINE void MON1_Falling_Edge_Int_En(void);

/** \brief Disables MON1 on falling edge interrupt.
 *
 * \brief <b>Example</b><br>
 * \brief This example treats the MON1 on falling edge interrupt.
 * ~~~~~~~~~~~~~~~{.c}
 * void Example_Function(void)
 * {
 *   MON1_Int_En();  
 *   MON1_Falling_Edge_Int_En();
 *   if ((uint8)SCU->IRCON1.bit.MON1F == (uint8)1)
 *   {
 *     MON1_FALLING_CALLBACK();
 *     MON1_Falling_Edge_Int_Clr();
 *   }
 *   MON1_Falling_Edge_Int_Dis();
 * }
 * ~~~~~~~~~~~~~~~
 * \ingroup mon_api
 */
INLINE void MON1_Falling_Edge_Int_Dis(void);

/** \brief Enables MON2 on rising edge interrupt.
 *
 * \brief <b>Example</b><br>
 * \brief This example treats the MON2 on rising edge interrupt.
 * ~~~~~~~~~~~~~~~{.c}
 * void Example_Function(void)
 * {
 *   MON2_Int_En();  
 *   MON2_Rising_Edge_Int_En();
 *   if ((uint8)SCU->IRCON1.bit.MON2R == (uint8)1)
 *   {
 *     MON2_RISING_CALLBACK();
 *     MON2_Rising_Edge_Int_Clr();
 *   }
 * }
 * ~~~~~~~~~~~~~~~
 * \ingroup mon_api
 */
INLINE void MON2_Rising_Edge_Int_En(void);

