keevin-xu/TLE-EVB-test-program/keil/RTE/Device/TLE9855QX/mon.h
/** \brief Disables MON2 on rising edge interrupt.
 *
 * \brief <b>Example</b><br>
 * \brief This example treats the MON2 on rising edge interrupt.
 * ~~~~~~~~~~~~~~~{.c}
 * void Example_Function(void)
 * {
 *   MON2_Int_En();    
 *   MON2_Rising_Edge_Int_En();
 *   if ((uint8)SCU->IRCON1.bit.MON2R == (uint8)1)
 *   {
 *     MON2_RISING_CALLBACK();
 *     MON2_Rising_Edge_Int_Clr();
 *   }
 *   MON2_Rising_Edge_Int_Dis();
 * }
 * ~~~~~~~~~~~~~~~
 * \ingroup mon_api
 */
INLINE void MON2_Rising_Edge_Int_Dis(void);

/** \brief Enables MON2 on falling edge interrupt.
 *
 * \brief <b>Example</b><br>
 * \brief This example treats the MON2 on falling edge interrupt.
 * ~~~~~~~~~~~~~~~{.c}
 * void Example_Function(void)
 * {
 *   MON2_Int_En();    
 *   MON2_Falling_Edge_Int_En();
 *   if ((uint8)SCU->IRCON1.bit.MON2F == (uint8)1)
 *   {
 *     MON2_FALLING_CALLBACK();
 *     MON2_Falling_Edge_Int_Clr();
 *   }
 * }
 * ~~~~~~~~~~~~~~~
 * \ingroup mon_api
 */
INLINE void MON2_Falling_Edge_Int_En(void);

/** \brief Disables MON2 on falling edge interrupt.
 *
 * \brief <b>Example</b><br>
 * \brief This example treats the MON2 on falling edge interrupt.
 * ~~~~~~~~~~~~~~~{.c}
 * void Example_Function(void)
 * {
 *   MON2_Int_En();    
 *   MON2_Falling_Edge_Int_En();
 *   if ((uint8)SCU->IRCON1.bit.MON2F == (uint8)1)
 *   {
 *     MON2_FALLING_CALLBACK();
 *     MON2_Falling_Edge_Int_Clr();
 *   }
 *   MON2_Falling_Edge_Int_Dis();
 * }
 * ~~~~~~~~~~~~~~~
 * \ingroup mon_api
 */
INLINE void MON2_Falling_Edge_Int_Dis(void);

/** \brief Enables MON3 on rising edge interrupt.
 *
 * \brief <b>Example</b><br>
 * \brief This example treats the MON3 on rising edge interrupt.
 * ~~~~~~~~~~~~~~~{.c}
 * void Example_Function(void)
 * {
 *   MON3_Int_En();      
 *   MON3_Rising_Edge_Int_En();
 *   if ((uint8)SCU->IRCON1.bit.MON3R == (uint8)1)
 *   {
 *     MON3_RISING_CALLBACK();
 *     MON3_Rising_Edge_Int_Clr();
 *   }
 * }
 * ~~~~~~~~~~~~~~~
 * \ingroup mon_api
 */
INLINE void MON3_Rising_Edge_Int_En(void);

/** \brief Disables MON3 on rising edge interrupt.
 *
 * \brief <b>Example</b><br>
 * \brief This example treats the MON3 on rising edge interrupt.
 * ~~~~~~~~~~~~~~~{.c}
 * void Example_Function(void)
 * {
 *   MON3_Int_En();    
 *   MON3_Rising_Edge_Int_En();
 *   if ((uint8)SCU->IRCON1.bit.MON3R == (uint8)1)
 *   {
 *     MON3_RISING_CALLBACK();
 *     MON3_Rising_Edge_Int_Clr();
 *   }
 *   MON3_Rising_Edge_Int_Dis();
 * }
 * ~~~~~~~~~~~~~~~
 * \ingroup mon_api
 */
INLINE void MON3_Rising_Edge_Int_Dis(void);

/** \brief Enables MON3 on falling edge interrupt.
 *
 * \brief <b>Example</b><br>
 * \brief This example treats the MON3 on falling edge interrupt.
 * ~~~~~~~~~~~~~~~{.c}
 * void Example_Function(void)
 * {
 *   MON3_Int_En();  
 *   MON3_Falling_Edge_Int_En();
 *   if ((uint8)SCU->IRCON1.bit.MON3F == (uint8)1)
 *   {
 *     MON3_FALLING_CALLBACK();
 *     MON3_Falling_Edge_Int_Clr();
 *   }
 * }
 * ~~~~~~~~~~~~~~~
 * \ingroup mon_api
 */
INLINE void MON3_Falling_Edge_Int_En(void);

/** \brief Disables MON3 on falling edge interrupt.
 *
 * \brief <b>Example</b><br>
 * \brief This example treats the MON3 on falling edge interrupt.
 * ~~~~~~~~~~~~~~~{.c}
 * void Example_Function(void)
 * {
 *   MON3_Int_En();  
 *   MON3_Falling_Edge_Int_En();
 *   if ((uint8)SCU->IRCON1.bit.MON3F == (uint8)1)
 *   {
 *     MON3_FALLING_CALLBACK();
 *     MON3_Falling_Edge_Int_Clr();
 *   }
 * }
 * ~~~~~~~~~~~~~~~
 * \ingroup mon_api
 */
INLINE void MON3_Falling_Edge_Int_Dis(void);

/** \brief Enables MON4 on rising edge interrupt.
 *
 * \brief <b>Example</b><br>
 * \brief This example treats the MON4 on rising edge interrupt.
 * ~~~~~~~~~~~~~~~{.c}
 * void Example_Function(void)
 * {
 *   MON4_Int_En();  
 *   MON4_Rising_Edge_Int_En();
 *   if ((uint8)SCU->IRCON1.bit.MON4R == (uint8)1)
 *   {
 *     MON4_RISING_CALLBACK();
 *     MON4_Rising_Edge_Int_Clr();
 *   }
 * }
 * ~~~~~~~~~~~~~~~
 * \ingroup mon_api
 */
INLINE void MON4_Rising_Edge_Int_En(void);

/** \brief Disables MON4 on rising edge interrupt.
 *
 * \brief <b>Example</b><br>
 * \brief This example treats the MON4 on rising edge interrupt.
 * ~~~~~~~~~~~~~~~{.c}
 * void Example_Function(void)
 * {
 *   MON4_Int_En();     
 *   MON4_Rising_Edge_Int_En();
 *   if ((uint8)SCU->IRCON1.bit.MON4R == (uint8)1)
 *   {
 *     MON4_RISING_CALLBACK();
 *     MON4_Rising_Edge_Int_Clr();
 *   }
 *   MON4_Rising_Edge_Int_Dis();
 * }
 * ~~~~~~~~~~~~~~~
 * \ingroup mon_api
 */
INLINE void MON4_Rising_Edge_Int_Dis(void);

/** \brief Enables MON4 on falling edge interrupt.
 *
 * \brief <b>Example</b><br>
 * \brief This example treats the MON4 on falling edge interrupt.
 * ~~~~~~~~~~~~~~~{.c}
 * void Example_Function(void)
 * {
 *   MON4_Int_En();     
 *   MON4_Falling_Edge_Int_En();
 *   if ((uint8)SCU->IRCON1.bit.MON4F == (uint8)1)
 *   {
 *     MON4_FALLING_CALLBACK();
 *     MON4_Falling_Edge_Int_Clr();
 *   }
 * }
 * ~~~~~~~~~~~~~~~
 * \ingroup mon_api
 */
INLINE void MON4_Falling_Edge_Int_En(void);

/** \brief Disables MON4 on falling edge interrupt.
 *
 * \brief <b>Example</b><br>
 * \brief This example treats the MON4 on falling edge interrupt.
 * ~~~~~~~~~~~~~~~{.c}
 * void Example_Function(void)
 * {
 *   MON4_Int_En();     
 *   MON4_Falling_Edge_Int_En();
 *   if ((uint8)SCU->IRCON1.bit.MON4F == (uint8)1)
 *   {
 *     MON4_FALLING_CALLBACK();
 *     MON4_Falling_Edge_Int_Clr();
 *   }
 *   MON4_Falling_Edge_Int_Dis();
 * }
 * ~~~~~~~~~~~~~~~
 * \ingroup mon_api
 */
INLINE void MON4_Falling_Edge_Int_Dis(void);

/** \brief Reads MON1 Status.
 *
 * \return MON1 Status
 *
 * \brief <b>Example</b><br>
 * \brief This example reads MON1 Status.
 * ~~~~~~~~~~~~~~~{.c}
 * void Example_Function(void)
 * {
 *     uint8 status;
 *
 *     status = MON1_Sts();
 * }
 * ~~~~~~~~~~~~~~~
 * \ingroup mon_api
 */
INLINE uint8 MON1_Sts(void);

/** \brief Enables PullUp for MON1.
 *
 * \brief <b>Example</b><br>
 * \brief This example enables PullUp for MON1.
 * ~~~~~~~~~~~~~~~{.c}
 * void Example_Function(void)
 * {
 *     MON1_En();  
 *     MON1_PullUp_En();
 * }
 * ~~~~~~~~~~~~~~~
 * \ingroup mon_api
 */
INLINE void MON1_PullUp_En(void);

/** \brief Disables PullUp for MON1.
 *
 * \brief <b>Example</b><br>
 * \brief This example disables PullUp for MON1.
 * ~~~~~~~~~~~~~~~{.c}
 * void Example_Function(void)
 * {
 *     MON1_En();  
 *     MON1_PullUp_Dis();
 * }
 * ~~~~~~~~~~~~~~~
 * \ingroup mon_api
 */
INLINE void MON1_PullUp_Dis(void);

/** \brief Enables PullDown for MON1.
 *
 * \brief <b>Example</b><br>
 * \brief This example enables PullDown for MON1.
 * ~~~~~~~~~~~~~~~{.c}
 * void Example_Function(void)
 * {
 *     MON1_En();  
 *     MON1_PullDown_En();
 * }
 * ~~~~~~~~~~~~~~~
 * \ingroup mon_api
 */
INLINE void MON1_PullDown_En(void);

