keevin-xu/TLE-EVB-test-program/keil/RTE/Device/TLE9855QX/mon.h
/** \brief Disables PullDown for MON1.
 *
 * \brief <b>Example</b><br>
 * \brief This example disables PullDown for MON1.
 * ~~~~~~~~~~~~~~~{.c}
 * void Example_Function(void)
 * {
 *     MON1_En();  
 *     MON1_PullDown_Dis();
 * }
 * ~~~~~~~~~~~~~~~
 * \ingroup mon_api
 */
INLINE void MON1_PullDown_Dis(void);

/** \brief Enables Cycle Sense for MON1.
 *
 * \brief <b>Example</b><br>
 * \brief This example enables Cycle Sense for MON1.
 * ~~~~~~~~~~~~~~~{.c}
 * void Example_Function(void)
 * {
 *     MON1_En();  
 *     MON1_CycSense_En();
 * }
 * ~~~~~~~~~~~~~~~
 * \ingroup mon_api
 */
INLINE void MON1_CycSense_En(void);

/** \brief Disables Cycle Sense for MON1.
 *
 * \brief <b>Example</b><br>
 * \brief This example disables Cycle Sense for MON1.
 * ~~~~~~~~~~~~~~~{.c}
 * void Example_Function(void)
 * {
 *     MON1_En();  
 *     MON1_CycSense_Dis();
 * }
 * ~~~~~~~~~~~~~~~
 * \ingroup mon_api
 */
INLINE void MON1_CycSense_Dis(void);

/** \brief Enables Wake-up on Rising Edge for MON1.
 *
 * \brief <b>Example</b><br>
 * \brief This example enables Wake-up on Rising Edge for MON1.
 * ~~~~~~~~~~~~~~~{.c}
 * void Example_Function(void)
 * {
 *     MON1_En();  
 *     MON1_WakeOnRise_En();
 * }
 * ~~~~~~~~~~~~~~~
 * \ingroup mon_api
 */
INLINE void MON1_WakeOnRise_En(void);

/** \brief Disables Wake-up on Rising Edge for MON1.
 *
 * \brief <b>Example</b><br>
 * \brief This example disables Wake-up on Rising Edge for MON1.
 * ~~~~~~~~~~~~~~~{.c}
 * void Example_Function(void)
 * {
 *     MON1_En();  
 *     MON1_WakeOnRise_Dis();
 * }
 * ~~~~~~~~~~~~~~~
 * \ingroup mon_api
 */
INLINE void MON1_WakeOnRise_Dis(void);

/** \brief Enables Wake-up on Falling Edge for MON1.
 *
 * \brief <b>Example</b><br>
 * \brief This example enables Wake-up on Falling Edge for MON1.
 * ~~~~~~~~~~~~~~~{.c}
 * void Example_Function(void)
 * {
 *     MON1_En();  
 *     MON1_WakeOnFall_En();
 * }
 * ~~~~~~~~~~~~~~~
 * \ingroup mon_api
 */
INLINE void MON1_WakeOnFall_En(void);

/** \brief Disables Wake-up on Falling Edge for MON1.
 *
 * \brief <b>Example</b><br>
 * \brief This example disables Wake-up on Falling Edge for MON1.
 * ~~~~~~~~~~~~~~~{.c}
 * void Example_Function(void)
 * {
 *     MON1_En();  
 *     MON1_WakeOnFall_Dis();
 * }
 * ~~~~~~~~~~~~~~~
 * \ingroup mon_api
 */
INLINE void MON1_WakeOnFall_Dis(void);

/** \brief Enables MON1.
 *
 * \brief <b>Example</b><br>
 * \brief This example enables Wake-up on Falling Edge for MON1.
 * ~~~~~~~~~~~~~~~{.c}
 * void Example_Function(void)
 * {
 *     MON1_En();  
 *     MON1_WakeOnFall_En();
 * }
 * ~~~~~~~~~~~~~~~
 * \ingroup mon_api
 */
INLINE void MON1_En(void);

/** \brief Disables MON1.
 *
 * \brief <b>Example</b><br>
 * \brief This example disables MON1.
 * ~~~~~~~~~~~~~~~{.c}
 * void Example_Function(void)
 * {
 *     MON1_Dis();  
 * }
 * ~~~~~~~~~~~~~~~
 * \ingroup mon_api
 */
INLINE void MON1_Dis(void);

/** \brief Reads MON2 Status.
 *
 * \return MON2 Status
 *
 * \brief <b>Example</b><br>
 * \brief This example reads MON2 Status.
 * ~~~~~~~~~~~~~~~{.c}
 * void Example_Function(void)
 * {
 *     uint8 status;
 *
 *     status = MON2_Sts();
 * }
 * ~~~~~~~~~~~~~~~
 * \ingroup mon_api
 */
INLINE uint8 MON2_Sts(void);

/** \brief Enables PullUp for MON2.
 *
 * \brief <b>Example</b><br>
 * \brief This example enables PullUp for MON2.
 * ~~~~~~~~~~~~~~~{.c}
 * void Example_Function(void)
 * {
 *     MON2_En();  
 *     MON2_PullUp_En();
 * }
 * ~~~~~~~~~~~~~~~
 * \ingroup mon_api
 */
INLINE void MON2_PullUp_En(void);

/** \brief Disables PullUp for MON2.
 *
 * \brief <b>Example</b><br>
 * \brief This example disables PullUp for MON2.
 * ~~~~~~~~~~~~~~~{.c}
 * void Example_Function(void)
 * {
 *     MON2_En();  
 *     MON2_PullUp_Dis();
 * }
 * ~~~~~~~~~~~~~~~
 * \ingroup mon_api
 */
INLINE void MON2_PullUp_Dis(void);

/** \brief Enables PullDown for MON2.
 *
 * \brief <b>Example</b><br>
 * \brief This example enables PullDown for MON2.
 * ~~~~~~~~~~~~~~~{.c}
 * void Example_Function(void)
 * {
 *     MON2_En();  
 *     MON2_PullDown_En();
 * }
 * ~~~~~~~~~~~~~~~
 * \ingroup mon_api
 */
INLINE void MON2_PullDown_En(void);

/** \brief Disables PullDown for MON2.
 *
 * \brief <b>Example</b><br>
 * \brief This example disables PullDown for MON2.
 * ~~~~~~~~~~~~~~~{.c}
 * void Example_Function(void)
 * {
 *     MON2_En();  
 *     MON2_PullDown_Dis();
 * }
 * ~~~~~~~~~~~~~~~
 * \ingroup mon_api
 */
INLINE void MON2_PullDown_Dis(void);

/** \brief Enables Cycle Sense for MON2.
 *
 * \brief <b>Example</b><br>
 * \brief This example enables Cycle Sense for MON2.
 * ~~~~~~~~~~~~~~~{.c}
 * void Example_Function(void)
 * {
 *     MON2_En();  
 *     MON2_CycSense_En();
 * }
 * ~~~~~~~~~~~~~~~
 * \ingroup mon_api
 */
INLINE void MON2_CycSense_En(void);

/** \brief Disables Cycle Sense for MON2.
 *
 * \brief <b>Example</b><br>
 * \brief This example disables Cycle Sense for MON2.
 * ~~~~~~~~~~~~~~~{.c}
 * void Example_Function(void)
 * {
 *     MON2_En();  
 *     MON2_CycSense_Dis();
 * }
 * ~~~~~~~~~~~~~~~
 * \ingroup mon_api
 */
INLINE void MON2_CycSense_Dis(void);

/** \brief Enables Wake-up on Rising Edge for MON2.
 *
 * \brief <b>Example</b><br>
 * \brief This example enables Wake-up on Rising Edge for MON2.
 * ~~~~~~~~~~~~~~~{.c}
 * void Example_Function(void)
 * {
 *     MON2_En();  
 *     MON2_WakeOnRise_En();
 * }
 * ~~~~~~~~~~~~~~~
 * \ingroup mon_api
 */
INLINE void MON2_WakeOnRise_En(void);

/** \brief Disables Wake-up on Rising Edge for MON2.
 *
 * \brief <b>Example</b><br>
 * \brief This example disables Wake-up on Rising Edge for MON2.
 * ~~~~~~~~~~~~~~~{.c}
 * void Example_Function(void)
 * {
 *     MON2_En();  
 *     MON2_WakeOnRise_Dis();
 * }
 * ~~~~~~~~~~~~~~~
 * \ingroup mon_api
 */
INLINE void MON2_WakeOnRise_Dis(void);

/** \brief Enables Wake-up on Falling Edge for MON2.
 *
 * \brief <b>Example</b><br>
 * \brief This example enables Wake-up on Falling Edge for MON2.
 * ~~~~~~~~~~~~~~~{.c}
 * void Example_Function(void)
 * {
 *     MON2_En();  
 *     MON2_WakeOnFall_En();
 * }
 * ~~~~~~~~~~~~~~~
 * \ingroup mon_api
 */
INLINE void MON2_WakeOnFall_En(void);

