keevin-xu/TLE-EVB-test-program/keil/RTE/Device/TLE9855QX/mon.h
/** \brief Disables Wake-up on Falling Edge for MON2.
 *
 * \brief <b>Example</b><br>
 * \brief This example disables Wake-up on Falling Edge for MON2.
 * ~~~~~~~~~~~~~~~{.c}
 * void Example_Function(void)
 * {
 *     MON2_En();  
 *     MON2_WakeOnFall_Dis();
 * }
 * ~~~~~~~~~~~~~~~
 * \ingroup mon_api
 */
INLINE void MON2_WakeOnFall_Dis(void);

/** \brief Enables MON2.
 *
 * \brief <b>Example</b><br>
 * \brief This example enables PullUp for MON2.
 * ~~~~~~~~~~~~~~~{.c}
 * void Example_Function(void)
 * {
 *     MON2_En();  
 *     MON2_PullUp_En();
 * }
 * ~~~~~~~~~~~~~~~
 * \ingroup mon_api
 */
INLINE void MON2_En(void);

/** \brief Disables MON2.
 *
 * \brief <b>Example</b><br>
 * \brief This example disables MON2.
 * ~~~~~~~~~~~~~~~{.c}
 * void Example_Function(void)
 * {
 *     MON2_Dis();
 * }
 * ~~~~~~~~~~~~~~~
 * \ingroup mon_api
 */
INLINE void MON2_Dis(void);

/** \brief Reads MON3 Status.
 *
 * \return MON3 Status
 *
 * \brief <b>Example</b><br>
 * \brief This example reads MON3 Status.
 * ~~~~~~~~~~~~~~~{.c}
 * void Example_Function(void)
 * {
 *     uint8 status;
 *
 *     status = MON3_Sts();
 * }
 * ~~~~~~~~~~~~~~~
 * \ingroup mon_api
 */
INLINE uint8 MON3_Sts(void);

/** \brief Enables PullUp for MON3.
 *
 * \brief <b>Example</b><br>
 * \brief This example enables PullUp for MON3.
 * ~~~~~~~~~~~~~~~{.c}
 * void Example_Function(void)
 * {
 *     MON3_En();  
 *     MON3_PullUp_En();
 * }
 * ~~~~~~~~~~~~~~~
 * \ingroup mon_api
 */
INLINE void MON3_PullUp_En(void);

/** \brief Disables PullUp for MON3.
 *
 * \brief <b>Example</b><br>
 * \brief This example disables PullUp for MON3.
 * ~~~~~~~~~~~~~~~{.c}
 * void Example_Function(void)
 * {
 *     MON3_En();  
 *     MON3_PullUp_Dis();
 * }
 * ~~~~~~~~~~~~~~~
 * \ingroup mon_api
 */
INLINE void MON3_PullUp_Dis(void);

/** \brief Enables PullDown for MON3.
 *
 * \brief <b>Example</b><br>
 * \brief This example enables PullDown for MON3.
 * ~~~~~~~~~~~~~~~{.c}
 * void Example_Function(void)
 * {
 *     MON3_En();  
 *     MON3_PullDown_En();
 * }
 * ~~~~~~~~~~~~~~~
 * \ingroup mon_api
 */
INLINE void MON3_PullDown_En(void);

/** \brief Disables PullDown for MON3.
 *
 * \brief <b>Example</b><br>
 * \brief This example disables PullDown for MON3.
 * ~~~~~~~~~~~~~~~{.c}
 * void Example_Function(void)
 * {
 *     MON3_En();  
 *     MON3_PullDown_Dis();
 * }
 * ~~~~~~~~~~~~~~~
 * \ingroup mon_api
 */
INLINE void MON3_PullDown_Dis(void);

/** \brief Enables Cycle Sense for MON3.
 *
 * \brief <b>Example</b><br>
 * \brief This example enables Cycle Sense for MON3.
 * ~~~~~~~~~~~~~~~{.c}
 * void Example_Function(void)
 * {
 *     MON3_En();  
 *     MON3_CycSense_En();
 * }
 * ~~~~~~~~~~~~~~~
 * \ingroup mon_api
 */
INLINE void MON3_CycSense_En(void);

/** \brief Disables Cycle Sense for MON3.
 *
 * \brief <b>Example</b><br>
 * \brief This example disables Cycle Sense for MON3.
 * ~~~~~~~~~~~~~~~{.c}
 * void Example_Function(void)
 * {
 *     MON3_En();  
 *     MON3_CycSense_Dis();
 * }
 * ~~~~~~~~~~~~~~~
 * \ingroup mon_api
 */
INLINE void MON3_CycSense_Dis(void);

/** \brief Enables Wake-up on Rising Edge for MON3.
 *
 * \brief <b>Example</b><br>
 * \brief This example enables Wake-up on Rising Edge for MON3.
 * ~~~~~~~~~~~~~~~{.c}
 * void Example_Function(void)
 * {
 *     MON3_En();  
 *     MON3_WakeOnRise_En();
 * }
 * ~~~~~~~~~~~~~~~
 * \ingroup mon_api
 */
INLINE void MON3_WakeOnRise_En(void);

/** \brief Disables Wake-up on Rising Edge for MON3.
 *
 * \brief <b>Example</b><br>
 * \brief This example disables Wake-up on Rising Edge for MON3.
 * ~~~~~~~~~~~~~~~{.c}
 * void Example_Function(void)
 * {
 *     MON3_En();  
 *     MON3_WakeOnRise_Dis();
 * }
 * ~~~~~~~~~~~~~~~
 * \ingroup mon_api
 */
INLINE void MON3_WakeOnRise_Dis(void);

/** \brief Enables Wake-up on Falling Edge for MON3.
 *
 * \brief <b>Example</b><br>
 * \brief This example enables Wake-up on Falling Edge for MON3.
 * ~~~~~~~~~~~~~~~{.c}
 * void Example_Function(void)
 * {
 *     MON3_En();  
 *     MON3_WakeOnFall_En();
 * }
 * ~~~~~~~~~~~~~~~
 * \ingroup mon_api
 */
INLINE void MON3_WakeOnFall_En(void);

/** \brief Disables Wake-up on Falling Edge for MON3.
 *
 * \brief <b>Example</b><br>
 * \brief This example disables Wake-up on Falling Edge for MON3.
 * ~~~~~~~~~~~~~~~{.c}
 * void Example_Function(void)
 * {
 *     MON3_En();  
 *     MON3_WakeOnFall_Dis();
 * }
 * ~~~~~~~~~~~~~~~
 * \ingroup mon_api
 */
INLINE void MON3_WakeOnFall_Dis(void);

/** \brief Enables MON3.
 *
 * \brief <b>Example</b><br>
 * \brief This example enables Cycle Sense for MON3.
 * ~~~~~~~~~~~~~~~{.c}
 * void Example_Function(void)
 * {
 *     MON3_En();  
 *     MON3_CycSense_En();
 * }
 * ~~~~~~~~~~~~~~~
 * \ingroup mon_api
 */
INLINE void MON3_En(void);

/** \brief Disables MON3.
 *
 * \brief <b>Example</b><br>
 * \brief This example disables MON3.
 * ~~~~~~~~~~~~~~~{.c}
 * void Example_Function(void)
 * {
 *     MON3_Dis();
 * }
 * ~~~~~~~~~~~~~~~
 * \ingroup mon_api
 */
INLINE void MON3_Dis(void);

/** \brief Reads MON4 Status.
 *
 * \return MON4 Status
 *
 * \brief <b>Example</b><br>
 * \brief This example reads MON4 Status.
 * ~~~~~~~~~~~~~~~{.c}
 * void Example_Function(void)
 * {
 *     uint8 status;
 *
 *     status = MON4_Sts();
 * }
 * ~~~~~~~~~~~~~~~
 * \ingroup mon_api
 */
INLINE uint8 MON4_Sts(void);

/** \brief Enables PullUp for MON4.
 *
 * \brief <b>Example</b><br>
 * \brief This example enables PullUp for MON4.
 * ~~~~~~~~~~~~~~~{.c}
 * void Example_Function(void)
 * {
 *     MON4_En();  
 *     MON4_PullUp_En();
 * }
 * ~~~~~~~~~~~~~~~
 * \ingroup mon_api
 */
INLINE void MON4_PullUp_En(void);

/** \brief Disables PullUp for MON4.
 *
 * \brief <b>Example</b><br>
 * \brief This example disables PullUp for MON4.
 * ~~~~~~~~~~~~~~~{.c}
 * void Example_Function(void)
 * {
 *     MON4_En();  
 *     MON4_PullUp_Dis();
 * }
 * ~~~~~~~~~~~~~~~
 * \ingroup mon_api
 */
INLINE void MON4_PullUp_Dis(void);

/** \brief Enables PullDown for MON4.
 *
 * \brief <b>Example</b><br>
 * \brief This example enables PullDown for MON4.
 * ~~~~~~~~~~~~~~~{.c}
 * void Example_Function(void)
 * {
 *     MON4_En();  
 *     MON4_PullDown_En();
 * }
 * ~~~~~~~~~~~~~~~
 * \ingroup mon_api
 */
INLINE void MON4_PullDown_En(void);

/** \brief Disables PullDown for MON4.
 *
 * \brief <b>Example</b><br>
 * \brief This example disables PullDown for MON4.
 * ~~~~~~~~~~~~~~~{.c}
 * void Example_Function(void)
 * {
 *     MON4_En();  
 *     MON4_PullDown_Dis();
 * }
 * ~~~~~~~~~~~~~~~
 * \ingroup mon_api
 */
INLINE void MON4_PullDown_Dis(void);

/** \brief Enables Cycle Sense for MON4.
 *
 * \brief <b>Example</b><br>
 * \brief This example enables Cycle Sense for MON4.
 * ~~~~~~~~~~~~~~~{.c}
 * void Example_Function(void)
 * {
 *     MON4_En();  
 *     MON4_CycSense_En();
 * }
 * ~~~~~~~~~~~~~~~
 * \ingroup mon_api
 */
INLINE void MON4_CycSense_En(void);

/** \brief Disables Cycle Sense for MON4.
 *
 * \brief <b>Example</b><br>
 * \brief This example disables Cycle Sense for MON4.
 * ~~~~~~~~~~~~~~~{.c}
 * void Example_Function(void)
 * {
 *     MON4_En();  
 *     MON4_CycSense_Dis();
 * }
 * ~~~~~~~~~~~~~~~
 * \ingroup mon_api
 */
INLINE void MON4_CycSense_Dis(void);

/** \brief Enables Wake-up on Rising Edge for MON4.
 *
 * \brief <b>Example</b><br>
 * \brief This example enables Wake-up on Rising Edge for MON4.
 * ~~~~~~~~~~~~~~~{.c}
 * void Example_Function(void)
 * {
 *     MON4_En();  
 *     MON4_WakeOnRise_En();
 * }
 * ~~~~~~~~~~~~~~~
 * \ingroup mon_api
 */
INLINE void MON4_WakeOnRise_En(void);

/** \brief Disables Wake-up on Rising Edge for MON4.
 *
 * \brief <b>Example</b><br>
 * \brief This example disables Wake-up on Rising Edge for MON4.
 * ~~~~~~~~~~~~~~~{.c}
 * void Example_Function(void)
 * {
 *     MON4_En();  
 *     MON4_WakeOnRise_Dis();
 * }
 * ~~~~~~~~~~~~~~~
 * \ingroup mon_api
 */
INLINE void MON4_WakeOnRise_Dis(void);

/** \brief Enables Wake-up on Falling Edge for MON4.
 *
 * \brief <b>Example</b><br>
 * \brief This example enables Wake-up on Falling Edge for MON4.
 * ~~~~~~~~~~~~~~~{.c}
 * void Example_Function(void)
 * {
 *     MON4_En();  
 *     MON4_WakeOnFall_En();
 * }
 * ~~~~~~~~~~~~~~~
 * \ingroup mon_api
 */
INLINE void MON4_WakeOnFall_En(void);

/** \brief Disables Wake-up on Falling Edge for MON4.
 *
 * \brief <b>Example</b><br>
 * \brief This example disables Wake-up on Falling Edge for MON4.
 * ~~~~~~~~~~~~~~~{.c}
 * void Example_Function(void)
 * {
 *     MON4_En();  
 *     MON4_WakeOnFall_Dis();
 * }
 * ~~~~~~~~~~~~~~~
 * \ingroup mon_api
 */
INLINE void MON4_WakeOnFall_Dis(void);

/** \brief Enables MON4.
 *
 * \brief <b>Example</b><br>
 * \brief This example enables PullDown for MON4.
 * ~~~~~~~~~~~~~~~{.c}
 * void Example_Function(void)
 * {
 *     MON4_En();  
 *     MON4_PullDown_En();
 * }
 * ~~~~~~~~~~~~~~~
 * \ingroup mon_api
 */
INLINE void MON4_En(void);

