keevin-xu/TLE-EVB-test-program/keil/RTE/Device/TLE9855QX/mon.h
/** \brief Disables MON4.
 *
 * \brief <b>Example</b><br>
 * \brief This example disables MON4.
 * ~~~~~~~~~~~~~~~{.c}
 * void Example_Function(void)
 * {
 *     MON4_Dis();
 * }
 * ~~~~~~~~~~~~~~~
 * \ingroup mon_api
 */
INLINE void MON4_Dis(void);

/** \brief Enables MON1 interrupt.
 *
 * \brief <b>Example</b><br>
 * \brief This example treats the MON1 on rising edge interrupt.
 * ~~~~~~~~~~~~~~~{.c}
 * void Example_Function(void)
 * {
 *   MON1_Int_En();   
 *   MON1_Rising_Edge_Int_En();
 *   if ((uint8)SCU->IRCON1.bit.MON1R == (uint8)1)
 *   {
 *     MON1_RISING_CALLBACK();
 *     MON1_Rising_Edge_Int_Clr();
 *   }
 * }
 * ~~~~~~~~~~~~~~~
 * \ingroup mon_api
 */
INLINE void MON1_Int_En(void);

/** \brief Enables MON2 interrupt.
 *
 * \brief <b>Example</b><br>
 * \brief This example treats the MON2 on rising edge interrupt.
 * ~~~~~~~~~~~~~~~{.c}
 * void Example_Function(void)
 * {
 *   MON2_Int_En();  
 *   MON2_Rising_Edge_Int_En();
 *   if ((uint8)SCU->IRCON1.bit.MON2R == (uint8)1)
 *   {
 *     MON2_RISING_CALLBACK();
 *     MON2_Rising_Edge_Int_Clr();
 *   }
 * }
 * ~~~~~~~~~~~~~~~
 * \ingroup mon_api
 */
INLINE void MON2_Int_En(void);

/** \brief Enables MON3 interrupt.
 *
 * \brief <b>Example</b><br>
 * \brief This example treats the MON3 on rising edge interrupt.
 * ~~~~~~~~~~~~~~~{.c}
 * void Example_Function(void)
 * {
 *   MON3_Int_En();   
 *   MON3_Rising_Edge_Int_En();
 *   if ((uint8)SCU->IRCON1.bit.MON3R == (uint8)1)
 *   {
 *     MON3_RISING_CALLBACK();
 *     MON3_Rising_Edge_Int_Clr();
 *   }
 * }
 * ~~~~~~~~~~~~~~~
 * \ingroup mon_api
 */
INLINE void MON3_Int_En(void);

/** \brief Enables MON4 interrupt.
 *
 * \brief <b>Example</b><br>
 * \brief This example treats the MON4 on rising edge interrupt.
 * ~~~~~~~~~~~~~~~{.c}
 * void Example_Function(void)
 * {
 *   MON4_Int_En();   
 *   MON4_Rising_Edge_Int_En();
 *   if ((uint8)SCU->IRCON1.bit.MON4R == (uint8)1)
 *   {
 *     MON4_RISING_CALLBACK();
 *     MON4_Rising_Edge_Int_Clr();
 *   }
 * }
 * ~~~~~~~~~~~~~~~
 * \ingroup mon_api
 */
INLINE void MON4_Int_En(void);

/** \brief Disables MON1 interrupt.
 *
 * \brief <b>Example</b><br>
 * \brief This example treats the MON1 on rising edge interrupt.
 * ~~~~~~~~~~~~~~~{.c}
 * void Example_Function(void)
 * {
 *   MON1_Int_En();   
 *   MON1_Rising_Edge_Int_En();
 *   if ((uint8)SCU->IRCON1.bit.MON1R == (uint8)1)
 *   {
 *     MON1_RISING_CALLBACK();
 *     MON1_Rising_Edge_Int_Clr();
 *   }
 *   MON1_Int_Dis();
 * }
 * ~~~~~~~~~~~~~~~
 * \ingroup mon_api
 */
INLINE void MON1_Int_Dis(void);

/** \brief Disables MON2 interrupt.
 *
 * \brief <b>Example</b><br>
 * \brief This example treats the MON2 on rising edge interrupt.
 * ~~~~~~~~~~~~~~~{.c}
 * void Example_Function(void)
 * {
 *   MON2_Int_En();  
 *   MON2_Rising_Edge_Int_En();
 *   if ((uint8)SCU->IRCON1.bit.MON2R == (uint8)1)
 *   {
 *     MON2_RISING_CALLBACK();
 *     MON2_Rising_Edge_Int_Clr();
 *   }
 *   MON2_Int_Dis();  
 * }
 * ~~~~~~~~~~~~~~~
 * \ingroup mon_api
 */
INLINE void MON2_Int_Dis(void);

/** \brief Disables MON3 interrupt.
 *
 * \brief <b>Example</b><br>
 * \brief This example treats the MON3 on rising edge interrupt.
 * ~~~~~~~~~~~~~~~{.c}
 * void Example_Function(void)
 * {
 *   MON3_Int_En();   
 *   MON3_Rising_Edge_Int_En();
 *   if ((uint8)SCU->IRCON1.bit.MON3R == (uint8)1)
 *   {
 *     MON3_RISING_CALLBACK();
 *     MON3_Rising_Edge_Int_Clr();
 *   }
 *   MON3_Int_Dis();
 * }
 * ~~~~~~~~~~~~~~~
 * \ingroup mon_api
 */
INLINE void MON3_Int_Dis(void);

/** \brief Disables MON4 interrupt.
 *
 * \brief <b>Example</b><br>
 * \brief This example treats the MON4 on rising edge interrupt.
 * ~~~~~~~~~~~~~~~{.c}
 * void Example_Function(void)
 * {
 *   MON4_Int_En();   
 *   MON4_Rising_Edge_Int_En();
 *   if ((uint8)SCU->IRCON1.bit.MON4R == (uint8)1)
 *   {
 *     MON4_RISING_CALLBACK();
 *     MON4_Rising_Edge_Int_Clr();
 *   }
 *   MON4_Int_Dis();
 * }
 * ~~~~~~~~~~~~~~~
 * \ingroup mon_api
 */
INLINE void MON4_Int_Dis(void);

/*******************************************************************************
**                         Inline Function Definitions                        **
*******************************************************************************/
INLINE void MON1_Rising_Edge_Int_Clr(void)
{
  Field_Wrt32(&SCU->IRCON1CLR.reg, (uint8)SCU_IRCON1CLR_MON1RC_Pos, SCU_IRCON1CLR_MON1RC_Msk, 1u);
}

INLINE void MON1_Falling_Edge_Int_Clr(void)
{
  Field_Wrt32(&SCU->IRCON1CLR.reg, (uint8)SCU_IRCON1CLR_MON1FC_Pos, SCU_IRCON1CLR_MON1FC_Msk, 1u);
}

INLINE void MON2_Rising_Edge_Int_Clr(void)
{
  Field_Wrt32(&SCU->IRCON1CLR.reg, (uint8)SCU_IRCON1CLR_MON2RC_Pos, SCU_IRCON1CLR_MON2RC_Msk, 1u);
}

INLINE void MON2_Falling_Edge_Int_Clr(void)
{
  Field_Wrt32(&SCU->IRCON1CLR.reg, (uint8)SCU_IRCON1CLR_MON2FC_Pos, SCU_IRCON1CLR_MON2FC_Msk, 1u);
}

INLINE void MON3_Rising_Edge_Int_Clr(void)
{
  Field_Wrt32(&SCU->IRCON1CLR.reg, (uint8)SCU_IRCON1CLR_MON3RC_Pos, SCU_IRCON1CLR_MON3RC_Msk, 1u);
}

INLINE void MON3_Falling_Edge_Int_Clr(void)
{
  Field_Wrt32(&SCU->IRCON1CLR.reg, (uint8)SCU_IRCON1CLR_MON3FC_Pos, SCU_IRCON1CLR_MON3FC_Msk, 1u);
}

INLINE void MON4_Rising_Edge_Int_Clr(void)
{
  Field_Wrt32(&SCU->IRCON1CLR.reg, (uint8)SCU_IRCON1CLR_MON4RC_Pos, SCU_IRCON1CLR_MON4RC_Msk, 1u);
}

INLINE void MON4_Falling_Edge_Int_Clr(void)
{
  Field_Wrt32(&SCU->IRCON1CLR.reg, (uint8)SCU_IRCON1CLR_MON4FC_Pos, SCU_IRCON1CLR_MON4FC_Msk, 1u);
}

INLINE void MON1_Rising_Edge_Int_En(void)
{
  Field_Mod32(&SCU->EXICON1.reg, (uint8)SCU_EXICON1_MON1_RE_Pos, SCU_EXICON1_MON1_RE_Msk, 1u);
}

INLINE void MON1_Rising_Edge_Int_Dis(void)
{
  Field_Mod32(&SCU->EXICON1.reg, (uint8)SCU_EXICON1_MON1_RE_Pos, SCU_EXICON1_MON1_RE_Msk, 0u);
}

INLINE void MON1_Falling_Edge_Int_En(void)
{
  Field_Mod32(&SCU->EXICON1.reg, (uint8)SCU_EXICON1_MON1_FE_Pos, SCU_EXICON1_MON1_FE_Msk, 1u);
}

INLINE void MON1_Falling_Edge_Int_Dis(void)
{
  Field_Mod32(&SCU->EXICON1.reg, (uint8)SCU_EXICON1_MON1_FE_Pos, SCU_EXICON1_MON1_FE_Msk, 0u);
}

INLINE void MON2_Rising_Edge_Int_En(void)
{
  Field_Mod32(&SCU->EXICON1.reg, (uint8)SCU_EXICON1_MON2_RE_Pos, SCU_EXICON1_MON2_RE_Msk, 1u);
}

INLINE void MON2_Rising_Edge_Int_Dis(void)
{
  Field_Mod32(&SCU->EXICON1.reg, (uint8)SCU_EXICON1_MON2_RE_Pos, SCU_EXICON1_MON2_RE_Msk, 0u);
}

