keevin-xu/TLE-EVB-test-program/keil/RTE/Device/TLE9855QX/mon.h
INLINE void MON2_Falling_Edge_Int_En(void)
{
  Field_Mod32(&SCU->EXICON1.reg, (uint8)SCU_EXICON1_MON2_FE_Pos, SCU_EXICON1_MON2_FE_Msk, 1u);
}

INLINE void MON2_Falling_Edge_Int_Dis(void)
{
  Field_Mod32(&SCU->EXICON1.reg, (uint8)SCU_EXICON1_MON2_FE_Pos, SCU_EXICON1_MON2_FE_Msk, 0u);
}

INLINE void MON3_Rising_Edge_Int_En(void)
{
  Field_Mod32(&SCU->EXICON1.reg, (uint8)SCU_EXICON1_MON3_RE_Pos, SCU_EXICON1_MON3_RE_Msk, 1u);
}

INLINE void MON3_Rising_Edge_Int_Dis(void)
{
  Field_Mod32(&SCU->EXICON1.reg, (uint8)SCU_EXICON1_MON3_RE_Pos, SCU_EXICON1_MON3_RE_Msk, 0u);
}

INLINE void MON3_Falling_Edge_Int_En(void)
{
  Field_Mod32(&SCU->EXICON1.reg, (uint8)SCU_EXICON1_MON3_FE_Pos, SCU_EXICON1_MON3_FE_Msk, 1u);
}

INLINE void MON3_Falling_Edge_Int_Dis(void)
{
  Field_Mod32(&SCU->EXICON1.reg, (uint8)SCU_EXICON1_MON3_FE_Pos, SCU_EXICON1_MON3_FE_Msk, 0u);
}

INLINE void MON4_Rising_Edge_Int_En(void)
{
  Field_Mod32(&SCU->EXICON1.reg, (uint8)SCU_EXICON1_MON4_RE_Pos, SCU_EXICON1_MON4_RE_Msk, 1u);
}

INLINE void MON4_Rising_Edge_Int_Dis(void)
{
  Field_Mod32(&SCU->EXICON1.reg, (uint8)SCU_EXICON1_MON4_RE_Pos, SCU_EXICON1_MON4_RE_Msk, 0u);
}

INLINE void MON4_Falling_Edge_Int_En(void)
{
  Field_Mod32(&SCU->EXICON1.reg, (uint8)SCU_EXICON1_MON4_FE_Pos, SCU_EXICON1_MON4_FE_Msk, 1u);
}

INLINE void MON4_Falling_Edge_Int_Dis(void)
{
  Field_Mod32(&SCU->EXICON1.reg, (uint8)SCU_EXICON1_MON4_FE_Pos, SCU_EXICON1_MON4_FE_Msk, 0u);
}

INLINE uint8 MON1_Sts(void)
{
  return(u1_Field_Rd32(&PMU->MON_CNF1.reg, (uint8)PMU_MON_CNF1_MON1_STS_Pos, PMU_MON_CNF1_MON1_STS_Msk));
}

INLINE void MON1_PullUp_En(void)
{
  Field_Mod32(&PMU->MON_CNF1.reg, (uint8)PMU_MON_CNF1_MON1_PU_Pos, PMU_MON_CNF1_MON1_PU_Msk, 1u);
}

INLINE void MON1_PullUp_Dis(void)
{
  Field_Mod32(&PMU->MON_CNF1.reg, (uint8)PMU_MON_CNF1_MON1_PU_Pos, PMU_MON_CNF1_MON1_PU_Msk, 0u);
}

INLINE void MON1_PullDown_En(void)
{
  Field_Mod32(&PMU->MON_CNF1.reg, (uint8)PMU_MON_CNF1_MON1_PD_Pos, PMU_MON_CNF1_MON1_PD_Msk, 1u);
}

INLINE void MON1_PullDown_Dis(void)
{
  Field_Mod32(&PMU->MON_CNF1.reg, (uint8)PMU_MON_CNF1_MON1_PD_Pos, PMU_MON_CNF1_MON1_PD_Msk, 0u);
}

INLINE void MON1_CycSense_En(void)
{
  Field_Mod32(&PMU->MON_CNF1.reg, (uint8)PMU_MON_CNF1_MON1_CYC_Pos, PMU_MON_CNF1_MON1_CYC_Msk, 1u);
}

INLINE void MON1_CycSense_Dis(void)
{
  Field_Mod32(&PMU->MON_CNF1.reg, (uint8)PMU_MON_CNF1_MON1_CYC_Pos, PMU_MON_CNF1_MON1_CYC_Msk, 0u);
}

INLINE void MON1_WakeOnRise_En(void)
{
  Field_Mod32(&PMU->MON_CNF1.reg, (uint8)PMU_MON_CNF1_MON1_RISE_Pos, PMU_MON_CNF1_MON1_RISE_Msk, 1u);
}

INLINE void MON1_WakeOnRise_Dis(void)
{
  Field_Mod32(&PMU->MON_CNF1.reg, (uint8)PMU_MON_CNF1_MON1_RISE_Pos, PMU_MON_CNF1_MON1_RISE_Msk, 0u);
}

INLINE void MON1_WakeOnFall_En(void)
{
  Field_Mod32(&PMU->MON_CNF1.reg, (uint8)PMU_MON_CNF1_MON1_FALL_Pos, PMU_MON_CNF1_MON1_FALL_Msk, 1u);
}

INLINE void MON1_WakeOnFall_Dis(void)
{
  Field_Mod32(&PMU->MON_CNF1.reg, (uint8)PMU_MON_CNF1_MON1_FALL_Pos, PMU_MON_CNF1_MON1_FALL_Msk, 0u);
}

INLINE void MON1_En(void)
{
  Field_Mod32(&PMU->MON_CNF1.reg, (uint8)PMU_MON_CNF1_MON1_EN_Pos, PMU_MON_CNF1_MON1_EN_Msk, 1u);
}

INLINE void MON1_Dis(void)
{
  Field_Mod32(&PMU->MON_CNF1.reg, (uint8)PMU_MON_CNF1_MON1_EN_Pos, PMU_MON_CNF1_MON1_EN_Msk, 0u);
}

INLINE uint8 MON2_Sts(void)
{
  return(u1_Field_Rd32(&PMU->MON_CNF1.reg, (uint8)PMU_MON_CNF1_MON2_STS_Pos, PMU_MON_CNF1_MON2_STS_Msk));
}

INLINE void MON2_PullUp_En(void)
{
  Field_Mod32(&PMU->MON_CNF1.reg, (uint8)PMU_MON_CNF1_MON2_PU_Pos, PMU_MON_CNF1_MON2_PU_Msk, 1u);
}

INLINE void MON2_PullUp_Dis(void)
{
  Field_Mod32(&PMU->MON_CNF1.reg, (uint8)PMU_MON_CNF1_MON2_PU_Pos, PMU_MON_CNF1_MON2_PU_Msk, 0u);
}

INLINE void MON2_PullDown_En(void)
{
  Field_Mod32(&PMU->MON_CNF1.reg, (uint8)PMU_MON_CNF1_MON2_PD_Pos, PMU_MON_CNF1_MON2_PD_Msk, 1u);
}

INLINE void MON2_PullDown_Dis(void)
{
  Field_Mod32(&PMU->MON_CNF1.reg, (uint8)PMU_MON_CNF1_MON2_PD_Pos, PMU_MON_CNF1_MON2_PD_Msk, 0u);
}

INLINE void MON2_CycSense_En(void)
{
  Field_Mod32(&PMU->MON_CNF1.reg, (uint8)PMU_MON_CNF1_MON2_CYC_Pos, PMU_MON_CNF1_MON2_CYC_Msk, 1u);
}

INLINE void MON2_CycSense_Dis(void)
{
  Field_Mod32(&PMU->MON_CNF1.reg, (uint8)PMU_MON_CNF1_MON2_CYC_Pos, PMU_MON_CNF1_MON2_CYC_Msk, 0u);
}

INLINE void MON2_WakeOnRise_En(void)
{
  Field_Mod32(&PMU->MON_CNF1.reg, (uint8)PMU_MON_CNF1_MON2_RISE_Pos, PMU_MON_CNF1_MON2_RISE_Msk, 1u);
}

INLINE void MON2_WakeOnRise_Dis(void)
{
  Field_Mod32(&PMU->MON_CNF1.reg, (uint8)PMU_MON_CNF1_MON2_RISE_Pos, PMU_MON_CNF1_MON2_RISE_Msk, 0u);
}

INLINE void MON2_WakeOnFall_En(void)
{
  Field_Mod32(&PMU->MON_CNF1.reg, (uint8)PMU_MON_CNF1_MON2_FALL_Pos, PMU_MON_CNF1_MON2_FALL_Msk, 1u);
}

INLINE void MON2_WakeOnFall_Dis(void)
{
  Field_Mod32(&PMU->MON_CNF1.reg, (uint8)PMU_MON_CNF1_MON2_FALL_Pos, PMU_MON_CNF1_MON2_FALL_Msk, 0u);
}

INLINE void MON2_En(void)
{
  Field_Mod32(&PMU->MON_CNF1.reg, (uint8)PMU_MON_CNF1_MON2_EN_Pos, PMU_MON_CNF1_MON2_EN_Msk, 1u);
}

INLINE void MON2_Dis(void)
{
  Field_Mod32(&PMU->MON_CNF1.reg, (uint8)PMU_MON_CNF1_MON2_EN_Pos, PMU_MON_CNF1_MON2_EN_Msk, 0u);
}

INLINE uint8 MON3_Sts(void)
{
  return(u1_Field_Rd32(&PMU->MON_CNF1.reg, (uint8)PMU_MON_CNF1_MON3_STS_Pos, PMU_MON_CNF1_MON3_STS_Msk));
}

INLINE void MON3_PullUp_En(void)
{
  Field_Mod32(&PMU->MON_CNF1.reg, (uint8)PMU_MON_CNF1_MON3_PU_Pos, PMU_MON_CNF1_MON3_PU_Msk, 1u);
}

INLINE void MON3_PullUp_Dis(void)
{
  Field_Mod32(&PMU->MON_CNF1.reg, (uint8)PMU_MON_CNF1_MON3_PU_Pos, PMU_MON_CNF1_MON3_PU_Msk, 0u);
}

INLINE void MON3_PullDown_En(void)
{
  Field_Mod32(&PMU->MON_CNF1.reg, (uint8)PMU_MON_CNF1_MON3_PD_Pos, PMU_MON_CNF1_MON3_PD_Msk, 1u);
}

INLINE void MON3_PullDown_Dis(void)
{
  Field_Mod32(&PMU->MON_CNF1.reg, (uint8)PMU_MON_CNF1_MON3_PD_Pos, PMU_MON_CNF1_MON3_PD_Msk, 0u);
}

INLINE void MON3_CycSense_En(void)
{
  Field_Mod32(&PMU->MON_CNF1.reg, (uint8)PMU_MON_CNF1_MON3_CYC_Pos, PMU_MON_CNF1_MON3_CYC_Msk, 1u);
}

INLINE void MON3_CycSense_Dis(void)
{
  Field_Mod32(&PMU->MON_CNF1.reg, (uint8)PMU_MON_CNF1_MON3_CYC_Pos, PMU_MON_CNF1_MON3_CYC_Msk, 0u);
}

INLINE void MON3_WakeOnRise_En(void)
{
  Field_Mod32(&PMU->MON_CNF1.reg, (uint8)PMU_MON_CNF1_MON3_RISE_Pos, PMU_MON_CNF1_MON3_RISE_Msk, 1u);
}

INLINE void MON3_WakeOnRise_Dis(void)
{
  Field_Mod32(&PMU->MON_CNF1.reg, (uint8)PMU_MON_CNF1_MON3_RISE_Pos, PMU_MON_CNF1_MON3_RISE_Msk, 0u);
}

INLINE void MON3_WakeOnFall_En(void)
{
  Field_Mod32(&PMU->MON_CNF1.reg, (uint8)PMU_MON_CNF1_MON3_FALL_Pos, PMU_MON_CNF1_MON3_FALL_Msk, 1u);
}

