keevin-xu/TLE-EVB-test-program/keil/RTE/Device/TLE9855QX/mon.h
INLINE void MON3_WakeOnFall_Dis(void)
{
  Field_Mod32(&PMU->MON_CNF1.reg, (uint8)PMU_MON_CNF1_MON3_FALL_Pos, PMU_MON_CNF1_MON3_FALL_Msk, 0u);
}

INLINE void MON3_En(void)
{
  Field_Mod32(&PMU->MON_CNF1.reg, (uint8)PMU_MON_CNF1_MON3_EN_Pos, PMU_MON_CNF1_MON3_EN_Msk, 1u);
}

INLINE void MON3_Dis(void)
{
  Field_Mod32(&PMU->MON_CNF1.reg, (uint8)PMU_MON_CNF1_MON3_EN_Pos, PMU_MON_CNF1_MON3_EN_Msk, 0u);
}

INLINE uint8 MON4_Sts(void)
{
  return(u1_Field_Rd32(&PMU->MON_CNF1.reg, (uint8)PMU_MON_CNF1_MON4_STS_Pos, PMU_MON_CNF1_MON4_STS_Msk));
}

INLINE void MON4_PullUp_En(void)
{
  Field_Mod32(&PMU->MON_CNF1.reg, (uint8)PMU_MON_CNF1_MON4_PU_Pos, PMU_MON_CNF1_MON4_PU_Msk, 1u);
}

INLINE void MON4_PullUp_Dis(void)
{
  Field_Mod32(&PMU->MON_CNF1.reg, (uint8)PMU_MON_CNF1_MON4_PU_Pos, PMU_MON_CNF1_MON4_PU_Msk, 0u);
}

INLINE void MON4_PullDown_En(void)
{
  Field_Mod32(&PMU->MON_CNF1.reg, (uint8)PMU_MON_CNF1_MON4_PD_Pos, PMU_MON_CNF1_MON4_PD_Msk, 1u);
}

INLINE void MON4_PullDown_Dis(void)
{
  Field_Mod32(&PMU->MON_CNF1.reg, (uint8)PMU_MON_CNF1_MON4_PD_Pos, PMU_MON_CNF1_MON4_PD_Msk, 0u);
}

INLINE void MON4_CycSense_En(void)
{
  Field_Mod32(&PMU->MON_CNF1.reg, (uint8)PMU_MON_CNF1_MON4_CYC_Pos, PMU_MON_CNF1_MON4_CYC_Msk, 1u);
}

INLINE void MON4_CycSense_Dis(void)
{
  Field_Mod32(&PMU->MON_CNF1.reg, (uint8)PMU_MON_CNF1_MON4_CYC_Pos, PMU_MON_CNF1_MON4_CYC_Msk, 0u);
}

INLINE void MON4_WakeOnRise_En(void)
{
  Field_Mod32(&PMU->MON_CNF1.reg, (uint8)PMU_MON_CNF1_MON4_RISE_Pos, PMU_MON_CNF1_MON4_RISE_Msk, 1u);
}

INLINE void MON4_WakeOnRise_Dis(void)
{
  Field_Mod32(&PMU->MON_CNF1.reg, (uint8)PMU_MON_CNF1_MON4_RISE_Pos, PMU_MON_CNF1_MON4_RISE_Msk, 0u);
}

INLINE void MON4_WakeOnFall_En(void)
{
  Field_Mod32(&PMU->MON_CNF1.reg, (uint8)PMU_MON_CNF1_MON4_FALL_Pos, PMU_MON_CNF1_MON4_FALL_Msk, 1u);
}

INLINE void MON4_WakeOnFall_Dis(void)
{
  Field_Mod32(&PMU->MON_CNF1.reg, (uint8)PMU_MON_CNF1_MON4_FALL_Pos, PMU_MON_CNF1_MON4_FALL_Msk, 0u);
}

INLINE void MON4_En(void)
{
  Field_Mod32(&PMU->MON_CNF1.reg, (uint8)PMU_MON_CNF1_MON4_EN_Pos, PMU_MON_CNF1_MON4_EN_Msk, 1u);
}

INLINE void MON4_Dis(void)
{
  Field_Mod32(&PMU->MON_CNF1.reg, (uint8)PMU_MON_CNF1_MON4_EN_Pos, PMU_MON_CNF1_MON4_EN_Msk, 0u);
}

INLINE void MON1_Int_En(void)
{
  Field_Mod32(&SCU->MONIEN.reg, (uint8)SCU_MONIEN_MON1IE_Pos, SCU_MONIEN_MON1IE_Msk, 1u);
}

INLINE void MON2_Int_En(void)
{
  Field_Mod32(&SCU->MONIEN.reg, (uint8)SCU_MONIEN_MON2IE_Pos, SCU_MONIEN_MON2IE_Msk, 1u);
}

INLINE void MON3_Int_En(void)
{
  Field_Mod32(&SCU->MONIEN.reg, (uint8)SCU_MONIEN_MON3IE_Pos, SCU_MONIEN_MON3IE_Msk, 1u);
}

INLINE void MON4_Int_En(void)
{
  Field_Mod32(&SCU->MONIEN.reg, (uint8)SCU_MONIEN_MON4IE_Pos, SCU_MONIEN_MON4IE_Msk, 1u);
}

INLINE void MON1_Int_Dis(void)
{
  Field_Mod32(&SCU->MONIEN.reg, (uint8)SCU_MONIEN_MON1IE_Pos, SCU_MONIEN_MON1IE_Msk, 0u);
}

INLINE void MON2_Int_Dis(void)
{
  Field_Mod32(&SCU->MONIEN.reg, (uint8)SCU_MONIEN_MON2IE_Pos, SCU_MONIEN_MON2IE_Msk, 0u);
}

INLINE void MON3_Int_Dis(void)
{
  Field_Mod32(&SCU->MONIEN.reg, (uint8)SCU_MONIEN_MON3IE_Pos, SCU_MONIEN_MON3IE_Msk, 0u);
}

INLINE void MON4_Int_Dis(void)
{
  Field_Mod32(&SCU->MONIEN.reg, (uint8)SCU_MONIEN_MON4IE_Pos, SCU_MONIEN_MON4IE_Msk, 0u);
}

#endif
